In [1]:
import pandas as pd

In [2]:
url = 'data/02_01_read_excel.xlsx'
df = pd.read_excel(url)
df

    이름  국어  영어  수학
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [3]:
pd.read_excel(url, sheet_name=1)

     두   번   째  시트
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [4]:
pd.read_excel(url, sheet_name=2)

  Unnamed: 0 Unnamed: 1 Unnamed: 2 Unnamed: 3
0        NaN        NaN        NaN        NaN
1         이름         국어         영어         수학
2        송중기         63         93         97
3        김나현         89         83         71
4        권보아         83         76         92
5        박효신         94         88         73

In [5]:
pd.read_excel(url, sheet_name=2, header=2)

    이름  국어  영어  수학
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [6]:
pd.read_excel(url, sheet_name=3)

  Unnamed: 0  국어  영어  수학
0        송중기  63  93  97
1        김나현  89  83  71
2        권보아  83  76  92
3        박효신  94  88  73

In [7]:
pd.read_excel(url, sheet_name=3, index_col=0)

     국어  영어  수학
송중기  63  93  97
김나현  89  83  71
권보아  83  76  92
박효신  94  88  73

## 데이터 프레임 병합

In [9]:
url = 'data/02_02_merge01.xlsx'
df1 = pd.read_excel(url)
df1.head()

    이름     제품
0  백철민   아이스티
1  박태인  레몬에이드
2  국지용  아메리카노
3  강민석  레몬에이드
4  박훈정   아이스티

In [11]:
df2 = pd.read_excel(url, sheet_name=1)
df2

      제품    가격
0  아메리카노  3900
1  바닐라라떼  3900
2   까페라떼  3900
3   아이스티  4400
4   얼그레이  3800
5    유자차  3500
6  아인슈페너  3500
7    자몽티  4100
8  레몬에이드  4400
9  오렌지주스  3600

In [14]:
df3 = df1.merge(df2, how='left').head()
df3

    이름     제품    가격
0  백철민   아이스티  4400
1  박태인  레몬에이드  4400
2  국지용  아메리카노  3900
3  강민석  레몬에이드  4400
4  박훈정   아이스티  4400

In [15]:
df3.to_excel('data/merge_result01.xlsx')